ikadatym-sry/ESP32-Cam-With-RPi/ESP32-CamV2.ino
/*
 * ESP-CAM WebServer with RPi*
 * ESP32-CAM V2 - Dual-Engine High-Performance Firmware
 * Architecture:
 *  - Port 8100 (Command & Telemetry Server): /status, /logs, /cmd, /capture, /update (Lightning fast <5ms response)
 *  - Port 8181 (Dedicated Stream Server): /stream (High-throughput MJPEG pipeline without blocking commands)
 *  - 2MB PSRAM optimized (SVGA 800x600 @ 20-25fps)
 *  - Zero SD card dependency (100% RAM + Network based)
 *  - Password-Protected OTA (ArduinoOTA & Web OTA) with Clean Flash/DMA Shutdown
 *  - NTP Real-World Time Sync (Auto UTC+7 Timestamp on every log line)
 *  - PWM Flashlight LED Control on GPIO 4 (0 - 100% smooth brightness)
 *  - On-chip fast motion detection engine
 *  - Web Serial Monitor & Logger (/logs) with PSRAM Ring Buffer
 *  - Hardware Diagnostics & Crash/Brownout Reason Detection (esp_reset_reason)
 * 
 * Target Board: AI Thinker ESP32-CAM
 * Arduino IDE Settings:
 *  - Board: "AI Thinker ESP32-CAM"
 *  - CPU Frequency: 240MHz (WiFi/BT)
 *  - Flash Frequency: 80MHz
 *  - Flash Mode: QIO
 *  - Partition Scheme: "Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)"
 *  - PSRAM: "Enabled"
 */

#include "esp_camera.h"
#include <WiFi.h>
#include "esp_http_server.h"
#include <Update.h>
#include <ArduinoOTA.h>
#include "esp_system.h"
#include "esp_sleep.h"
#include "time.h"
#include "esp_arduino_version.h"
const char* WIFI_SSID     = "";
const char* WIFI_PASSWORD = "";
const int CMD_SERVER_PORT    = 8100; // Commands, Status, Logs, OTA
const int STREAM_SERVER_PORT = 8181; // Dedicated MJPEG Video Stream
const char* OTA_PASSWORD  = "admin"; 

// NTP Timezone Settings: GMT+7 (Bangkok / Thailand Timezone)
const char* NTP_SERVER_1  = "pool.ntp.org";
const char* NTP_SERVER_2  = "time.google.com";
const long  GMT_OFFSET_SEC = 7 * 3600; // GMT+7
const int   DAYLIGHT_OFFSET_SEC = 0;

// Motion Detection Sensitivity (0 - 100)
int motionSensitivity = 25; 
int motionThreshold = 15;

// ==========================================
// 2. AI-THINKER CAMERA PIN ASSIGNMENTS
// ==========================================
#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27

#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22

#define FLASH_LED_PIN      4  // On-board Bright Flashlight LED
#define FLASH_PWM_CHANNEL  7  // LEDC PWM Channel
#define ONBOARD_LED_PIN   33  // Small Red/Blue Status LED (Active LOW)

// Cross-version PWM Helpers
void setupFlashPWM() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(FLASH_LED_PIN, 5000, 8);
  ledcWrite(FLASH_LED_PIN, 0);
#else
  ledcSetup(FLASH_PWM_CHANNEL, 5000, 8);
  ledcAttachPin(FLASH_LED_PIN, FLASH_PWM_CHANNEL);
  ledcWrite(FLASH_PWM_CHANNEL, 0);
#endif
}

void writeFlashPWM(int duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(FLASH_LED_PIN, duty);
#else
  ledcWrite(FLASH_PWM_CHANNEL, duty);
#endif
}

// ==========================================
// 3. PSRAM LOG BUFFER (REAL-WORLD TIMESTAMPS)
// ==========================================
#define MAX_LOG_LINES 150
#define MAX_LOG_LINE_LEN 180

char logBuffer[MAX_LOG_LINES][MAX_LOG_LINE_LEN];
int logHead = 0;
int logCount = 0;
String lastResetReasonStr = "Unknown";
bool timeSynced = false;

void addLog(const char* format, ...) {
  char temp[MAX_LOG_LINE_LEN];
  va_list args;
  va_start(args, format);
  vsnprintf(temp, sizeof(temp), format, args);
  va_end(args);

  char timeStr[32];
  struct tm timeinfo;
  if (timeSynced && getLocalTime(&timeinfo, 10)) {
    strftime(timeStr, sizeof(timeStr), "%Y-%m-%d %H:%M:%S", &timeinfo);
  } else {
    unsigned long sec = millis() / 1000;
    snprintf(timeStr, sizeof(timeStr), "Boot+%02lu:%02lu:%02lu", 
             (sec / 3600), (sec % 3600) / 60, sec % 60);
  }

  Serial.printf("[%s] %s\n", timeStr, temp);

  snprintf(logBuffer[logHead], MAX_LOG_LINE_LEN, "[%s] %s", timeStr, temp);
  logHead = (logHead + 1) % MAX_LOG_LINES;
  if (logCount < MAX_LOG_LINES) logCount++;
}

void checkResetReason() {
  esp_reset_reason_t reason = esp_reset_reason();
  switch (reason) {
    case ESP_RST_POWERON:   lastResetReasonStr = "Power-on Reset (Normal Boot)"; break;
    case ESP_RST_SW:        lastResetReasonStr = "Software Reset (Remote Reboot)"; break;
    case ESP_RST_PANIC:     lastResetReasonStr = "CRASH / PANIC EXCEPTION!"; break;
    case ESP_RST_INT_WDT:   lastResetReasonStr = "Interrupt Watchdog Reset!"; break;
    case ESP_RST_TASK_WDT:  lastResetReasonStr = "Task Watchdog Reset!"; break;
    case ESP_RST_WDT:       lastResetReasonStr = "Hardware Watchdog Reset!"; break;
    case ESP_RST_DEEPSLEEP: lastResetReasonStr = "Wakeup from Deep Sleep"; break;
    case ESP_RST_BROWNOUT:  lastResetReasonStr = "BROWNOUT RESET! (Power supply voltage dropped below 2.7V)"; break;
    case ESP_RST_SDIO:      lastResetReasonStr = "SDIO Reset"; break;
    default:                lastResetReasonStr = "Unknown Reset"; break;
  }
  addLog("[SYS] Boot Reason: %s", lastResetReasonStr.c_str());
}

// ==========================================
// 4. GLOBAL STATE
// ==========================================
httpd_handle_t camera_httpd = NULL; // Port 8100
httpd_handle_t stream_httpd = NULL; // Port 8181

bool motionDetected = false;
int lastMotionScore = 0;
unsigned long lastMotionTime = 0;
const unsigned long MOTION_HOLD_TIME_MS = 3000;

unsigned long lastFrameTime = 0;
float currentFPS = 0.0;
unsigned long frameCount = 0;
unsigned long fpsTimer = 0;

bool flashLedState = false;
int flashBrightness = 0; // 0 - 255
bool isUpdatingOTA = false;

#define MOTION_GRID_W 32
#define MOTION_GRID_H 24
#define MOTION_GRID_SIZE (MOTION_GRID_W * MOTION_GRID_H)
uint8_t prevMotionGrid[MOTION_GRID_SIZE];
bool isFirstMotionFrame = true;

// ==========================================
// 5. MOTION DETECTION ENGINE
// ==========================================
bool processMotionDetection(camera_fb_t* fb) {
  if (!fb || fb->len == 0) return false;

