ikadatym-sry/ESP32-Cam-With-RPi/ESP32-CamV2.ino
  uint8_t currentGrid[MOTION_GRID_SIZE];
  size_t step = fb->len / MOTION_GRID_SIZE;
  if (step == 0) step = 1;

  for (int i = 0; i < MOTION_GRID_SIZE; i++) {
    size_t idx = i * step;
    currentGrid[i] = (idx < fb->len) ? fb->buf[idx] : 0;
  }

  if (isFirstMotionFrame) {
    memcpy(prevMotionGrid, currentGrid, MOTION_GRID_SIZE);
    isFirstMotionFrame = false;
    return false;
  }

  int changedBlocks = 0;
  for (int i = 0; i < MOTION_GRID_SIZE; i++) {
    int delta = abs((int)currentGrid[i] - (int)prevMotionGrid[i]);
    if (delta > motionSensitivity) changedBlocks++;
    prevMotionGrid[i] = (uint8_t)(((int)prevMotionGrid[i] * 7 + (int)currentGrid[i] * 3) / 10);
  }

  lastMotionScore = changedBlocks;

  if (changedBlocks >= motionThreshold) {
    if (!motionDetected) {
      addLog("[MOTION] Triggered! Score: %d (Thresh: %d)", changedBlocks, motionThreshold);
    }
    motionDetected = true;
    lastMotionTime = millis();
    return true;
  } else {
    if (millis() - lastMotionTime > MOTION_HOLD_TIME_MS) {
      motionDetected = false;
    }
    return false;
  }
}

// ==========================================
// 6. PORT 8181: DEDICATED STREAM ENGINE
// ==========================================
static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

  addLog("[STREAM] Client connected to live stream on Port %d.", STREAM_SERVER_PORT);

  res = httpd_resp_set_type(req, "multipart/x-mixed-replace; boundary=frame");
  if (res != ESP_OK) return res;
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  while (!isUpdatingOTA) {
    fb = esp_camera_fb_get();
    if (!fb) {
      vTaskDelay(10 / portTICK_PERIOD_MS);
      continue;
    }

    processMotionDetection(fb);

    frameCount++;
    if (millis() - fpsTimer >= 1000) {
      currentFPS = (frameCount * 1000.0) / (millis() - fpsTimer);
      frameCount = 0;
      fpsTimer = millis();
    }

    char header_buf[140];
    int hlen = snprintf(header_buf, sizeof(header_buf),
                        "--frame\r\nContent-Type: image/jpeg\r\nContent-Length: %u\r\nX-Motion: %s\r\nX-Motion-Score: %d\r\n\r\n",
                        fb->len, motionDetected ? "true" : "false", lastMotionScore);

    res = httpd_resp_send_chunk(req, header_buf, hlen);
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)fb->buf, fb->len);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, "\r\n", 2);
    }

    esp_camera_fb_return(fb);
    fb = NULL;

    if (res != ESP_OK) {
      break;
    }
  }

  addLog("[STREAM] Client disconnected from Port %d.", STREAM_SERVER_PORT);
  return res;
}

// ==========================================
// 7. PORT 8100: COMMAND & DIAGNOSTICS HANDLERS
// ==========================================

// --- Handler: Status (/status) ---
static esp_err_t status_handler(httpd_req_t *req) {
  float dieTemp = temperatureRead();
  char timeStr[32] = "N/A";
  struct tm timeinfo;
  if (timeSynced && getLocalTime(&timeinfo, 10)) {
    strftime(timeStr, sizeof(timeStr), "%Y-%m-%d %H:%M:%S", &timeinfo);
  }

  char jsonBuffer[650];
  snprintf(jsonBuffer, sizeof(jsonBuffer),
    "{\n"
    "  \"current_time\": \"%s\",\n"
    "  \"temperature_c\": %.2f,\n"
    "  \"psram_total_bytes\": %u,\n"
    "  \"psram_free_bytes\": %u,\n"
    "  \"psram_min_free_bytes\": %u,\n"
    "  \"heap_free_bytes\": %u,\n"
    "  \"heap_min_free_bytes\": %u,\n"
    "  \"wifi_rssi_dbm\": %d,\n"
    "  \"motion_detected\": %s,\n"
    "  \"motion_score\": %d,\n"
    "  \"fps\": %.2f,\n"
    "  \"uptime_seconds\": %lu,\n"
    "  \"reset_reason\": \"%s\",\n"
    "  \"flash_led\": %s,\n"
    "  \"flash_brightness\": %d,\n"
    "  \"cmd_port\": %d,\n"
    "  \"stream_port\": %d,\n"
    "  \"resolution\": \"SVGA 800x600\"\n"
    "}",
    timeStr,
    dieTemp,
    ESP.getPsramSize(),
    ESP.getFreePsram(),
    ESP.getMinFreePsram(),
    ESP.getFreeHeap(),
    ESP.getMinFreeHeap(),
    WiFi.RSSI(),
    motionDetected ? "true" : "false",
    lastMotionScore,
    currentFPS,
    millis() / 1000,
    lastResetReasonStr.c_str(),
    flashLedState ? "true" : "false",
    flashBrightness,
    CMD_SERVER_PORT,
    STREAM_SERVER_PORT
  );

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, jsonBuffer, HTTPD_RESP_USE_STRLEN);
}

// --- Handler: Logs (/logs) ---
static esp_err_t logs_handler(httpd_req_t *req) {
  String out = "{\n  \"reset_reason\": \"" + lastResetReasonStr + "\",\n  \"logs\": [\n";
  
  int start = (logCount == MAX_LOG_LINES) ? logHead : 0;
  for (int i = 0; i < logCount; i++) {
    int idx = (start + i) % MAX_LOG_LINES;
    out += "    \"";
    String line = String(logBuffer[idx]);
    line.replace("\"", "\\\"");
    line.replace("\r", "");
    line.replace("\n", "");
    out += line;
    out += (i == logCount - 1) ? "\"\n" : "\",\n";
  }
  out += "  ]\n}";

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, out.c_str(), out.length());
}

// --- Handler: Commands (/cmd) ---
static esp_err_t cmd_handler(httpd_req_t *req) {
  char query[128];
  char action[32] = {0};
  char val_str[32] = {0};

  size_t query_len = httpd_req_get_url_query_len(req);
  if (query_len > 0 && query_len < sizeof(query)) {
    httpd_req_get_url_query_str(req, query, sizeof(query));
    httpd_query_key_value(query, "action", action, sizeof(action));
    httpd_query_key_value(query, "val", val_str, sizeof(val_str));
  }

  if (action[0] == '\0' && req->content_len > 0 && req->content_len < sizeof(query)) {
    char body[128];
    int received = httpd_req_recv(req, body, req->content_len);
    if (received > 0) {
      body[received] = '\0';
      httpd_query_key_value(body, "action", action, sizeof(action));
      httpd_query_key_value(body, "val", val_str, sizeof(val_str));
    }
  }

  if (action[0] == '\0') {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing action");
    return ESP_FAIL;
  }

