ikadatym-sry/ESP32-Cam-With-RPi/ESP32-CamV2.ino
  addLog("[CMD] Received command: %s", action);

  if (strcmp(action, "reboot") == 0) {
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_send(req, "{\"status\": \"rebooting\", \"message\": \"ESP32 restarting...\"}", HTTPD_RESP_USE_STRLEN);
    addLog("[SYS] Rebooting ESP32 via Web command...");
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    ESP.restart();
    return ESP_OK;
  }
  else if (strcmp(action, "sleep") == 0) {
    unsigned long durationMs = 60000;
    char ms_str[32] = {0};
    char sec_str[32] = {0};
    char min_str[32] = {0};
    httpd_query_key_value(query, "ms", ms_str, sizeof(ms_str));
    httpd_query_key_value(query, "sec", sec_str, sizeof(sec_str));
    httpd_query_key_value(query, "min", min_str, sizeof(min_str));

    if (ms_str[0] != '\0') durationMs = atol(ms_str);
    else if (sec_str[0] != '\0') durationMs = atol(sec_str) * 1000UL;
    else if (min_str[0] != '\0') durationMs = atol(min_str) * 60000UL;

    if (durationMs < 1000) durationMs = 1000;

    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    char resp[128];
    snprintf(resp, sizeof(resp), "{\"status\": \"sleeping\", \"duration_ms\": %lu, \"message\": \"ESP32 entering Deep Sleep...\"}", durationMs);
    httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);

    addLog("[PWR] Entering Deep Sleep for %lu ms (%.1f sec)...", durationMs, durationMs / 1000.0);
    vTaskDelay(500 / portTICK_PERIOD_MS);

    esp_camera_deinit();
    digitalWrite(ONBOARD_LED_PIN, HIGH);
    writeFlashPWM(0);
    
    uint64_t sleepUs = (uint64_t)durationMs * 1000ULL;
    esp_sleep_enable_timer_wakeup(sleepUs);
    esp_deep_sleep_start();
    return ESP_OK;
  }
  else if (strcmp(action, "flash") == 0 || strcmp(action, "flash_toggle") == 0) {
    int duty = 0;
    if (val_str[0] != '\0') {
      duty = atoi(val_str);
    } else {
      duty = flashLedState ? 0 : 128;
    }

    if (duty < 0) duty = 0;
    if (duty > 255) duty = 255;

    flashBrightness = duty;
    flashLedState = (duty > 0);

    writeFlashPWM(duty);
    addLog("[LED] Flashlight brightness: %d / 255 (%.0f%%)", duty, (duty / 255.0) * 100);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    char resp[100];
    snprintf(resp, sizeof(resp), "{\"flash_led\": %s, \"brightness\": %d}", flashLedState ? "true" : "false", duty);
    return httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);
  }
  else if (strcmp(action, "set_sens") == 0) {
    if (val_str[0] != '\0') {
      motionSensitivity = atoi(val_str);
      addLog("[MOTION] Sensitivity updated to: %d", motionSensitivity);
    }
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    char resp[80];
    snprintf(resp, sizeof(resp), "{\"status\": \"ok\", \"sensitivity\": %d}", motionSensitivity);
    return httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);
  }

  httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Unknown command");
  return ESP_FAIL;
}

// --- Handler: Snapshot Capture (/capture) ---
static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  esp_err_t res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  esp_camera_fb_return(fb);
  return res;
}

// --- Handler: Password-Protected OTA Post (/update) ---
static esp_err_t ota_post_handler(httpd_req_t *req) {
  char query[128] = {0};
  char pwd[64] = {0};
  size_t query_len = httpd_req_get_url_query_len(req);
  if (query_len > 0 && query_len < sizeof(query)) {
    httpd_req_get_url_query_str(req, query, sizeof(query));
    httpd_query_key_value(query, "pwd", pwd, sizeof(pwd));
  }

  if (strcmp(pwd, OTA_PASSWORD) != 0) {
    addLog("[OTA] Authentication Failed! Invalid Password.");
    httpd_resp_send_err(req, HTTPD_401_UNAUTHORIZED, "Invalid OTA Password");
    return ESP_FAIL;
  }

  isUpdatingOTA = true;
  char buf[1024];
  size_t remaining = req->content_len;
  addLog("[OTA] Authorized! Flashing %u bytes to Flash Partition...", remaining);

  if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
    isUpdatingOTA = false;
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA Begin Failed");
    return ESP_FAIL;
  }

  while (remaining > 0) {
    int received = httpd_req_recv(req, buf, min(remaining, sizeof(buf)));
    if (received <= 0) {
      if (received == HTTPD_SOCK_ERR_TIMEOUT) continue;
      Update.abort();
      isUpdatingOTA = false;
      httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA Stream Interrupted");
      return ESP_FAIL;
    }

    if (Update.write((uint8_t*)buf, received) != received) {
      Update.abort();
      isUpdatingOTA = false;
      httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA Write Failed");
      return ESP_FAIL;
    }
    remaining -= received;
  }

  if (Update.end(true)) {
    addLog("[OTA] Update Succeeded! Rebooting...");
    httpd_resp_set_type(req, "text/plain");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_send(req, "UPDATE SUCCESSFUL! Rebooting...", HTTPD_RESP_USE_STRLEN);
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    ESP.restart();
    return ESP_OK;
  } else {
    isUpdatingOTA = false;
    addLog("[OTA] Update Finalize Failed!");
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA End Failed");
    return ESP_FAIL;
  }
}

// Start Dual-Engine HTTP Servers (Port 8100 & Port 8181)
void startCameraServer() {
  // 1. Port 8100: Command, Telemetry, and OTA Server
  httpd_config_t config_cmd = HTTPD_DEFAULT_CONFIG();
  config_cmd.server_port = CMD_SERVER_PORT;
  config_cmd.ctrl_port = 32768;
  config_cmd.max_open_sockets = 5;

  httpd_uri_t uri_status = { .uri = "/status", .method = HTTP_GET, .handler = status_handler, .user_ctx = NULL };
  httpd_uri_t uri_logs   = { .uri = "/logs",   .method = HTTP_GET, .handler = logs_handler,   .user_ctx = NULL };
  httpd_uri_t uri_cmd_g  = { .uri = "/cmd",    .method = HTTP_GET, .handler = cmd_handler,    .user_ctx = NULL };
  httpd_uri_t uri_cmd_p  = { .uri = "/cmd",    .method = HTTP_POST, .handler = cmd_handler,   .user_ctx = NULL };
  httpd_uri_t uri_capture= { .uri = "/capture",.method = HTTP_GET, .handler = capture_handler,.user_ctx = NULL };
  httpd_uri_t uri_update = { .uri = "/update", .method = HTTP_POST, .handler = ota_post_handler, .user_ctx = NULL };

  if (httpd_start(&camera_httpd, &config_cmd) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &uri_status);
    httpd_register_uri_handler(camera_httpd, &uri_logs);
    httpd_register_uri_handler(camera_httpd, &uri_cmd_g);
    httpd_register_uri_handler(camera_httpd, &uri_cmd_p);
    httpd_register_uri_handler(camera_httpd, &uri_capture);
    httpd_register_uri_handler(camera_httpd, &uri_update);
    addLog("[HTTP] Command & Telemetry Server running on Port %d", CMD_SERVER_PORT);
  }

  // 2. Port 8181: Dedicated High-Speed Stream Server
  httpd_config_t config_stream = HTTPD_DEFAULT_CONFIG();
  config_stream.server_port = STREAM_SERVER_PORT;
  config_stream.ctrl_port = 32769;
  config_stream.max_open_sockets = 3;

  httpd_uri_t uri_stream = { .uri = "/stream", .method = HTTP_GET, .handler = stream_handler, .user_ctx = NULL };

  if (httpd_start(&stream_httpd, &config_stream) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &uri_stream);
    addLog("[HTTP] Dedicated Video Stream Server running on Port %d", STREAM_SERVER_PORT);
  }
}

// ==========================================
// 8. INITIALIZATION & SETUP
// ==========================================
void setup() {
  Serial.begin(115200);
  delay(500);

  pinMode(ONBOARD_LED_PIN, OUTPUT);
  digitalWrite(ONBOARD_LED_PIN, HIGH);

