ikadatym-sry/ESP32-Cam-With-RPi/ESP32-CamV2.ino
  setupFlashPWM();

  addLog("==========================================");
  addLog("   ESP32-CAM V2 Firmware Starting...      ");
  addLog("==========================================");

  checkResetReason();

  if (psramFound()) {
    addLog("[PSRAM] Found: %u bytes (%.2f MB), Free: %u bytes",
           ESP.getPsramSize(),
           ESP.getPsramSize() / (1024.0 * 1024.0),
           ESP.getFreePsram());
  } else {
    addLog("[PSRAM] WARNING: PSRAM NOT FOUND!");
  }

  // Camera Setup
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer   = LEDC_TIMER_0;
  config.pin_d0       = Y2_GPIO_NUM;
  config.pin_d1       = Y3_GPIO_NUM;
  config.pin_d2       = Y4_GPIO_NUM;
  config.pin_d3       = Y5_GPIO_NUM;
  config.pin_d4       = Y6_GPIO_NUM;
  config.pin_d5       = Y7_GPIO_NUM;
  config.pin_d6       = Y8_GPIO_NUM;
  config.pin_d7       = Y9_GPIO_NUM;
  config.pin_xclk     = XCLK_GPIO_NUM;
  config.pin_pclk     = PCLK_GPIO_NUM;
  config.pin_vsync    = VSYNC_GPIO_NUM;
  config.pin_href     = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn     = PWDN_GPIO_NUM;
  config.pin_reset    = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size   = FRAMESIZE_SVGA; // 800x600
  config.jpeg_quality = 12;
  config.fb_count     = 2;
  config.fb_location  = CAMERA_FB_IN_PSRAM;
  config.grab_mode    = CAMERA_GRAB_LATEST;

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    addLog("[CAMERA] Init Failed with error 0x%x! Rebooting in 3s...", err);
    delay(3000);
    ESP.restart();
  }
  addLog("[CAMERA] OV2640 Initialized (SVGA 800x600)");

  sensor_t* s = esp_camera_sensor_get();
  if (s != NULL) {
    s->set_brightness(s, 0);
    s->set_contrast(s, 0);
    s->set_saturation(s, 0);
    s->set_whitebal(s, 1);
    s->set_awb_gain(s, 1);
    s->set_exposure_ctrl(s, 1);
    s->set_gain_ctrl(s, 1);
  }

  // Connect to Wi-Fi
  addLog("[WIFI] Connecting to SSID: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int retryCount = 0;
  while (WiFi.status() != WL_CONNECTED && retryCount < 30) {
    delay(500);
    retryCount++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    addLog("[WIFI] Connected! IP: http://%s (RSSI: %d dBm)", 
           WiFi.localIP().toString().c_str(), WiFi.RSSI());

    configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, NTP_SERVER_1, NTP_SERVER_2);
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 3000)) {
      timeSynced = true;
      addLog("[NTP] Real-World Time Synced (GMT+7)");
    }
  } else {
    addLog("[WIFI] Connection Failed! Rebooting...");
    delay(3000);
    ESP.restart();
  }

  // Setup ArduinoOTA with Clean Callbacks
  ArduinoOTA.setHostname("esp32cam-v2");
  ArduinoOTA.setPassword(OTA_PASSWORD);
  ArduinoOTA
    .onStart([]() {
      isUpdatingOTA = true;
      addLog("[OTA] ArduinoOTA Inbound Flash Stream Started!");
    })
    .onEnd([]() {
      addLog("[OTA] Flash Complete!");
    })
    .onError([](ota_error_t error) {
      isUpdatingOTA = false;
      addLog("[OTA] Error Code: %u", error);
    });

  ArduinoOTA.begin();
  addLog("[OTA] ArduinoOTA Ready (Password Protected)");

  // Start Dual-Engine HTTP Servers (Port 8100 & 8181)
  startCameraServer();
}

// ==========================================
// 9. MAIN LOOP
// ==========================================
void loop() {
  ArduinoOTA.handle();

  if (!timeSynced && WiFi.status() == WL_CONNECTED) {
    static unsigned long lastNtpCheck = 0;
    if (millis() - lastNtpCheck > 5000) {
      struct tm timeinfo;
      if (getLocalTime(&timeinfo, 100)) {
        timeSynced = true;
        addLog("[NTP] Time Synced Successfully!");
      }
      lastNtpCheck = millis();
    }
  }

  if (WiFi.status() != WL_CONNECTED) {
    static unsigned long lastReconnect = 0;
    if (millis() - lastReconnect > 10000) {
      addLog("[WIFI] Disconnected! Reconnecting...");
      WiFi.reconnect();
      lastReconnect = millis();
    }
  }

  if (motionDetected) {
    digitalWrite(ONBOARD_LED_PIN, LOW);
  } else {
    digitalWrite(ONBOARD_LED_PIN, HIGH);
  }

  yield();
}
